GopalSaraf/Practicals/PSDL/include/proc/pic16lf18446.inc
// Register: RA5PPS
#define RA5PPS RA5PPS
RA5PPS                                   equ 01F15h
// bitfield definitions
RA5PPS_RA5PPS_POSN                       equ 0000h
RA5PPS_RA5PPS_POSITION                   equ 0000h
RA5PPS_RA5PPS_SIZE                       equ 0006h
RA5PPS_RA5PPS_LENGTH                     equ 0006h
RA5PPS_RA5PPS_MASK                       equ 003Fh
RA5PPS_RA5PPS0_POSN                      equ 0000h
RA5PPS_RA5PPS0_POSITION                  equ 0000h
RA5PPS_RA5PPS0_SIZE                      equ 0001h
RA5PPS_RA5PPS0_LENGTH                    equ 0001h
RA5PPS_RA5PPS0_MASK                      equ 0001h
RA5PPS_RA5PPS1_POSN                      equ 0001h
RA5PPS_RA5PPS1_POSITION                  equ 0001h
RA5PPS_RA5PPS1_SIZE                      equ 0001h
RA5PPS_RA5PPS1_LENGTH                    equ 0001h
RA5PPS_RA5PPS1_MASK                      equ 0002h
RA5PPS_RA5PPS2_POSN                      equ 0002h
RA5PPS_RA5PPS2_POSITION                  equ 0002h
RA5PPS_RA5PPS2_SIZE                      equ 0001h
RA5PPS_RA5PPS2_LENGTH                    equ 0001h
RA5PPS_RA5PPS2_MASK                      equ 0004h
RA5PPS_RA5PPS3_POSN                      equ 0003h
RA5PPS_RA5PPS3_POSITION                  equ 0003h
RA5PPS_RA5PPS3_SIZE                      equ 0001h
RA5PPS_RA5PPS3_LENGTH                    equ 0001h
RA5PPS_RA5PPS3_MASK                      equ 0008h
RA5PPS_RA5PPS4_POSN                      equ 0004h
RA5PPS_RA5PPS4_POSITION                  equ 0004h
RA5PPS_RA5PPS4_SIZE                      equ 0001h
RA5PPS_RA5PPS4_LENGTH                    equ 0001h
RA5PPS_RA5PPS4_MASK                      equ 0010h
RA5PPS_RA5PPS5_POSN                      equ 0005h
RA5PPS_RA5PPS5_POSITION                  equ 0005h
RA5PPS_RA5PPS5_SIZE                      equ 0001h
RA5PPS_RA5PPS5_LENGTH                    equ 0001h
RA5PPS_RA5PPS5_MASK                      equ 0020h

// Register: RB4PPS
#define RB4PPS RB4PPS
RB4PPS                                   equ 01F1Ch
// bitfield definitions
RB4PPS_RB4PPS_POSN                       equ 0000h
RB4PPS_RB4PPS_POSITION                   equ 0000h
RB4PPS_RB4PPS_SIZE                       equ 0006h
RB4PPS_RB4PPS_LENGTH                     equ 0006h
RB4PPS_RB4PPS_MASK                       equ 003Fh
RB4PPS_RB4PPS0_POSN                      equ 0000h
RB4PPS_RB4PPS0_POSITION                  equ 0000h
RB4PPS_RB4PPS0_SIZE                      equ 0001h
RB4PPS_RB4PPS0_LENGTH                    equ 0001h
RB4PPS_RB4PPS0_MASK                      equ 0001h
RB4PPS_RB4PPS1_POSN                      equ 0001h
RB4PPS_RB4PPS1_POSITION                  equ 0001h
RB4PPS_RB4PPS1_SIZE                      equ 0001h
RB4PPS_RB4PPS1_LENGTH                    equ 0001h
RB4PPS_RB4PPS1_MASK                      equ 0002h
RB4PPS_RB4PPS2_POSN                      equ 0002h
RB4PPS_RB4PPS2_POSITION                  equ 0002h
RB4PPS_RB4PPS2_SIZE                      equ 0001h
RB4PPS_RB4PPS2_LENGTH                    equ 0001h
RB4PPS_RB4PPS2_MASK                      equ 0004h
RB4PPS_RB4PPS3_POSN                      equ 0003h
RB4PPS_RB4PPS3_POSITION                  equ 0003h
RB4PPS_RB4PPS3_SIZE                      equ 0001h
RB4PPS_RB4PPS3_LENGTH                    equ 0001h
RB4PPS_RB4PPS3_MASK                      equ 0008h
RB4PPS_RB4PPS4_POSN                      equ 0004h
RB4PPS_RB4PPS4_POSITION                  equ 0004h
RB4PPS_RB4PPS4_SIZE                      equ 0001h
RB4PPS_RB4PPS4_LENGTH                    equ 0001h
RB4PPS_RB4PPS4_MASK                      equ 0010h
RB4PPS_RB4PPS5_POSN                      equ 0005h
RB4PPS_RB4PPS5_POSITION                  equ 0005h
RB4PPS_RB4PPS5_SIZE                      equ 0001h
RB4PPS_RB4PPS5_LENGTH                    equ 0001h
RB4PPS_RB4PPS5_MASK                      equ 0020h

// Register: RB5PPS
#define RB5PPS RB5PPS
RB5PPS                                   equ 01F1Dh
// bitfield definitions
RB5PPS_RB5PPS_POSN                       equ 0000h
RB5PPS_RB5PPS_POSITION                   equ 0000h
RB5PPS_RB5PPS_SIZE                       equ 0006h
RB5PPS_RB5PPS_LENGTH                     equ 0006h
RB5PPS_RB5PPS_MASK                       equ 003Fh
RB5PPS_RB5PPS0_POSN                      equ 0000h
RB5PPS_RB5PPS0_POSITION                  equ 0000h
RB5PPS_RB5PPS0_SIZE                      equ 0001h
RB5PPS_RB5PPS0_LENGTH                    equ 0001h
RB5PPS_RB5PPS0_MASK                      equ 0001h
RB5PPS_RB5PPS1_POSN                      equ 0001h
RB5PPS_RB5PPS1_POSITION                  equ 0001h
RB5PPS_RB5PPS1_SIZE                      equ 0001h
RB5PPS_RB5PPS1_LENGTH                    equ 0001h
RB5PPS_RB5PPS1_MASK                      equ 0002h
RB5PPS_RB5PPS2_POSN                      equ 0002h
RB5PPS_RB5PPS2_POSITION                  equ 0002h
RB5PPS_RB5PPS2_SIZE                      equ 0001h
RB5PPS_RB5PPS2_LENGTH                    equ 0001h
RB5PPS_RB5PPS2_MASK                      equ 0004h
RB5PPS_RB5PPS3_POSN                      equ 0003h
RB5PPS_RB5PPS3_POSITION                  equ 0003h
RB5PPS_RB5PPS3_SIZE                      equ 0001h
RB5PPS_RB5PPS3_LENGTH                    equ 0001h
RB5PPS_RB5PPS3_MASK                      equ 0008h
RB5PPS_RB5PPS4_POSN                      equ 0004h
RB5PPS_RB5PPS4_POSITION                  equ 0004h
RB5PPS_RB5PPS4_SIZE                      equ 0001h
RB5PPS_RB5PPS4_LENGTH                    equ 0001h
RB5PPS_RB5PPS4_MASK                      equ 0010h
RB5PPS_RB5PPS5_POSN                      equ 0005h
RB5PPS_RB5PPS5_POSITION                  equ 0005h
RB5PPS_RB5PPS5_SIZE                      equ 0001h
RB5PPS_RB5PPS5_LENGTH                    equ 0001h
RB5PPS_RB5PPS5_MASK                      equ 0020h

// Register: RB6PPS
#define RB6PPS RB6PPS
RB6PPS                                   equ 01F1Eh
// bitfield definitions
RB6PPS_RB6PPS_POSN                       equ 0000h
RB6PPS_RB6PPS_POSITION                   equ 0000h
RB6PPS_RB6PPS_SIZE                       equ 0006h
RB6PPS_RB6PPS_LENGTH                     equ 0006h
RB6PPS_RB6PPS_MASK                       equ 003Fh
RB6PPS_RB6PPS0_POSN                      equ 0000h
RB6PPS_RB6PPS0_POSITION                  equ 0000h
RB6PPS_RB6PPS0_SIZE                      equ 0001h
RB6PPS_RB6PPS0_LENGTH                    equ 0001h
RB6PPS_RB6PPS0_MASK                      equ 0001h
RB6PPS_RB6PPS1_POSN                      equ 0001h
RB6PPS_RB6PPS1_POSITION                  equ 0001h
RB6PPS_RB6PPS1_SIZE                      equ 0001h
RB6PPS_RB6PPS1_LENGTH                    equ 0001h
RB6PPS_RB6PPS1_MASK                      equ 0002h
RB6PPS_RB6PPS2_POSN                      equ 0002h
RB6PPS_RB6PPS2_POSITION                  equ 0002h
RB6PPS_RB6PPS2_SIZE                      equ 0001h
RB6PPS_RB6PPS2_LENGTH                    equ 0001h
RB6PPS_RB6PPS2_MASK                      equ 0004h
RB6PPS_RB6PPS3_POSN                      equ 0003h
RB6PPS_RB6PPS3_POSITION                  equ 0003h
RB6PPS_RB6PPS3_SIZE                      equ 0001h
RB6PPS_RB6PPS3_LENGTH                    equ 0001h
RB6PPS_RB6PPS3_MASK                      equ 0008h
RB6PPS_RB6PPS4_POSN                      equ 0004h
RB6PPS_RB6PPS4_POSITION                  equ 0004h
RB6PPS_RB6PPS4_SIZE                      equ 0001h
RB6PPS_RB6PPS4_LENGTH                    equ 0001h
RB6PPS_RB6PPS4_MASK                      equ 0010h
RB6PPS_RB6PPS5_POSN                      equ 0005h
RB6PPS_RB6PPS5_POSITION                  equ 0005h
RB6PPS_RB6PPS5_SIZE                      equ 0001h
RB6PPS_RB6PPS5_LENGTH                    equ 0001h
RB6PPS_RB6PPS5_MASK                      equ 0020h

// Register: RB7PPS
#define RB7PPS RB7PPS
RB7PPS                                   equ 01F1Fh
// bitfield definitions
RB7PPS_RB7PPS_POSN                       equ 0000h
RB7PPS_RB7PPS_POSITION                   equ 0000h
RB7PPS_RB7PPS_SIZE                       equ 0006h
RB7PPS_RB7PPS_LENGTH                     equ 0006h
RB7PPS_RB7PPS_MASK                       equ 003Fh
RB7PPS_RB7PPS0_POSN                      equ 0000h
RB7PPS_RB7PPS0_POSITION                  equ 0000h
RB7PPS_RB7PPS0_SIZE                      equ 0001h
RB7PPS_RB7PPS0_LENGTH                    equ 0001h
RB7PPS_RB7PPS0_MASK                      equ 0001h
RB7PPS_RB7PPS1_POSN                      equ 0001h
RB7PPS_RB7PPS1_POSITION                  equ 0001h
RB7PPS_RB7PPS1_SIZE                      equ 0001h
RB7PPS_RB7PPS1_LENGTH                    equ 0001h
RB7PPS_RB7PPS1_MASK                      equ 0002h
RB7PPS_RB7PPS2_POSN                      equ 0002h
RB7PPS_RB7PPS2_POSITION                  equ 0002h
RB7PPS_RB7PPS2_SIZE                      equ 0001h
RB7PPS_RB7PPS2_LENGTH                    equ 0001h
RB7PPS_RB7PPS2_MASK                      equ 0004h
RB7PPS_RB7PPS3_POSN                      equ 0003h
RB7PPS_RB7PPS3_POSITION                  equ 0003h
RB7PPS_RB7PPS3_SIZE                      equ 0001h
RB7PPS_RB7PPS3_LENGTH                    equ 0001h
RB7PPS_RB7PPS3_MASK                      equ 0008h
RB7PPS_RB7PPS4_POSN                      equ 0004h
RB7PPS_RB7PPS4_POSITION                  equ 0004h
RB7PPS_RB7PPS4_SIZE                      equ 0001h
RB7PPS_RB7PPS4_LENGTH                    equ 0001h
RB7PPS_RB7PPS4_MASK                      equ 0010h
RB7PPS_RB7PPS5_POSN                      equ 0005h
RB7PPS_RB7PPS5_POSITION                  equ 0005h
RB7PPS_RB7PPS5_SIZE                      equ 0001h
RB7PPS_RB7PPS5_LENGTH                    equ 0001h
RB7PPS_RB7PPS5_MASK                      equ 0020h

// Register: RC0PPS
#define RC0PPS RC0PPS
RC0PPS                                   equ 01F20h
// bitfield definitions
RC0PPS_RC0PPS_POSN                       equ 0000h
RC0PPS_RC0PPS_POSITION                   equ 0000h
RC0PPS_RC0PPS_SIZE                       equ 0006h
RC0PPS_RC0PPS_LENGTH                     equ 0006h
RC0PPS_RC0PPS_MASK                       equ 003Fh
RC0PPS_RC0PPS0_POSN                      equ 0000h
RC0PPS_RC0PPS0_POSITION                  equ 0000h
RC0PPS_RC0PPS0_SIZE                      equ 0001h
RC0PPS_RC0PPS0_LENGTH                    equ 0001h
RC0PPS_RC0PPS0_MASK                      equ 0001h
RC0PPS_RC0PPS1_POSN                      equ 0001h
RC0PPS_RC0PPS1_POSITION                  equ 0001h
RC0PPS_RC0PPS1_SIZE                      equ 0001h
RC0PPS_RC0PPS1_LENGTH                    equ 0001h
RC0PPS_RC0PPS1_MASK                      equ 0002h
RC0PPS_RC0PPS2_POSN                      equ 0002h
RC0PPS_RC0PPS2_POSITION                  equ 0002h
RC0PPS_RC0PPS2_SIZE                      equ 0001h
RC0PPS_RC0PPS2_LENGTH                    equ 0001h
RC0PPS_RC0PPS2_MASK                      equ 0004h
RC0PPS_RC0PPS3_POSN                      equ 0003h
RC0PPS_RC0PPS3_POSITION                  equ 0003h
RC0PPS_RC0PPS3_SIZE                      equ 0001h
RC0PPS_RC0PPS3_LENGTH                    equ 0001h
RC0PPS_RC0PPS3_MASK                      equ 0008h
RC0PPS_RC0PPS4_POSN                      equ 0004h
RC0PPS_RC0PPS4_POSITION                  equ 0004h
RC0PPS_RC0PPS4_SIZE                      equ 0001h
RC0PPS_RC0PPS4_LENGTH                    equ 0001h
RC0PPS_RC0PPS4_MASK                      equ 0010h
RC0PPS_RC0PPS5_POSN                      equ 0005h
RC0PPS_RC0PPS5_POSITION                  equ 0005h
RC0PPS_RC0PPS5_SIZE                      equ 0001h
RC0PPS_RC0PPS5_LENGTH                    equ 0001h
RC0PPS_RC0PPS5_MASK                      equ 0020h

// Register: RC1PPS
#define RC1PPS RC1PPS
RC1PPS                                   equ 01F21h
// bitfield definitions
RC1PPS_RC1PPS_POSN                       equ 0000h
RC1PPS_RC1PPS_POSITION                   equ 0000h
RC1PPS_RC1PPS_SIZE                       equ 0006h
RC1PPS_RC1PPS_LENGTH                     equ 0006h
RC1PPS_RC1PPS_MASK                       equ 003Fh
RC1PPS_RC1PPS0_POSN                      equ 0000h
RC1PPS_RC1PPS0_POSITION                  equ 0000h
RC1PPS_RC1PPS0_SIZE                      equ 0001h
RC1PPS_RC1PPS0_LENGTH                    equ 0001h
RC1PPS_RC1PPS0_MASK                      equ 0001h
RC1PPS_RC1PPS1_POSN                      equ 0001h
RC1PPS_RC1PPS1_POSITION                  equ 0001h
RC1PPS_RC1PPS1_SIZE                      equ 0001h
RC1PPS_RC1PPS1_LENGTH                    equ 0001h
RC1PPS_RC1PPS1_MASK                      equ 0002h
RC1PPS_RC1PPS2_POSN                      equ 0002h
RC1PPS_RC1PPS2_POSITION                  equ 0002h
RC1PPS_RC1PPS2_SIZE                      equ 0001h
RC1PPS_RC1PPS2_LENGTH                    equ 0001h
RC1PPS_RC1PPS2_MASK                      equ 0004h
RC1PPS_RC1PPS3_POSN                      equ 0003h
RC1PPS_RC1PPS3_POSITION                  equ 0003h
RC1PPS_RC1PPS3_SIZE                      equ 0001h
RC1PPS_RC1PPS3_LENGTH                    equ 0001h
RC1PPS_RC1PPS3_MASK                      equ 0008h
RC1PPS_RC1PPS4_POSN                      equ 0004h
RC1PPS_RC1PPS4_POSITION                  equ 0004h
RC1PPS_RC1PPS4_SIZE                      equ 0001h
RC1PPS_RC1PPS4_LENGTH                    equ 0001h
RC1PPS_RC1PPS4_MASK                      equ 0010h
RC1PPS_RC1PPS5_POSN                      equ 0005h
RC1PPS_RC1PPS5_POSITION                  equ 0005h
RC1PPS_RC1PPS5_SIZE                      equ 0001h
RC1PPS_RC1PPS5_LENGTH                    equ 0001h
RC1PPS_RC1PPS5_MASK                      equ 0020h

// Register: RC2PPS
#define RC2PPS RC2PPS
RC2PPS                                   equ 01F22h
// bitfield definitions
RC2PPS_RC2PPS_POSN                       equ 0000h
RC2PPS_RC2PPS_POSITION                   equ 0000h
RC2PPS_RC2PPS_SIZE                       equ 0006h
RC2PPS_RC2PPS_LENGTH                     equ 0006h
RC2PPS_RC2PPS_MASK                       equ 003Fh
RC2PPS_RC2PPS0_POSN                      equ 0000h
RC2PPS_RC2PPS0_POSITION                  equ 0000h
RC2PPS_RC2PPS0_SIZE                      equ 0001h
RC2PPS_RC2PPS0_LENGTH                    equ 0001h
RC2PPS_RC2PPS0_MASK                      equ 0001h
RC2PPS_RC2PPS1_POSN                      equ 0001h
RC2PPS_RC2PPS1_POSITION                  equ 0001h
RC2PPS_RC2PPS1_SIZE                      equ 0001h
RC2PPS_RC2PPS1_LENGTH                    equ 0001h
RC2PPS_RC2PPS1_MASK                      equ 0002h
RC2PPS_RC2PPS2_POSN                      equ 0002h
RC2PPS_RC2PPS2_POSITION                  equ 0002h
RC2PPS_RC2PPS2_SIZE                      equ 0001h
RC2PPS_RC2PPS2_LENGTH                    equ 0001h
RC2PPS_RC2PPS2_MASK                      equ 0004h
RC2PPS_RC2PPS3_POSN                      equ 0003h
RC2PPS_RC2PPS3_POSITION                  equ 0003h
RC2PPS_RC2PPS3_SIZE                      equ 0001h
RC2PPS_RC2PPS3_LENGTH                    equ 0001h
RC2PPS_RC2PPS3_MASK                      equ 0008h
RC2PPS_RC2PPS4_POSN                      equ 0004h
RC2PPS_RC2PPS4_POSITION                  equ 0004h
RC2PPS_RC2PPS4_SIZE                      equ 0001h
RC2PPS_RC2PPS4_LENGTH                    equ 0001h
RC2PPS_RC2PPS4_MASK                      equ 0010h
RC2PPS_RC2PPS5_POSN                      equ 0005h
RC2PPS_RC2PPS5_POSITION                  equ 0005h
RC2PPS_RC2PPS5_SIZE                      equ 0001h
RC2PPS_RC2PPS5_LENGTH                    equ 0001h
RC2PPS_RC2PPS5_MASK                      equ 0020h

